Мюнцкабинент_30/src/Catalogs/Минцмейстеры/Минцмейстеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Минцмейстеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Буквы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Мюнцкабинент_30/src/Catalogs/Минцмейстеры/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//
	Поля.Добавить ("Наименование");
	Поля.Добавить ("Буквы");
	Поля.Добавить ("ЭтоГруппа");
	Поля.Добавить ("ГодНачала");
	Поля.Добавить ("ГодОкончания");
	//
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//
	Если Данные.ЭтоГруппа Тогда
		Представление 		= Данные.Наименование;	
	Иначе	
		Представление 		= Данные.Буквы + " - " + Данные.Наименование;
		Если Данные.ГодНачала = Данные.ГодОкончания Тогда
			Представление     = Представление + " ("+ Формат (Данные.ГодНачала, "ЧГ=0") + " г.)"
		Иначе
			Представление     = Представление + " ("+ Формат (Данные.ГодНачала, "ЧГ=0") + "-" + Формат (Данные.ГодОкончания, "ЧГ=0") + " гг.)"
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
